tutorials/cfdemSolverPiso/periodicChannel/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo 0.1;

libs ( "libfvOptionsCFDEM.so" );

functions
(

    probes
    {
        type        probes;
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );  
        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            (0.00003 0.05 0.05)
            (0.39999 0.05 0.05)
        );

        // Fields to be probed
        fields ( p U voidfraction );

        // Write at same frequency as fields
        outputControl   timeStep;//outputTime;
        outputInterval  1;
    }


    volFlow_inlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;//timeStep;
        log             true;
	    writeArea	    true; //write for OF 3.0 to be consistent
        valueOutput     true;
        source          patch;
        sourceName      inlet;
        operation       sum;

        fields
        (
            phi
        );
        surfaceFormat null;
    }

    volFlow_outlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;//timeStep;
        log             true;
        writeArea       true; //write for OF 3.0 to be consistent
        valueOutput     true;
        source          patch;
        sourceName      outlet;
        operation       sum;

        fields
        (
            phi
        );
        surfaceFormat null;
    }

    volFlow_wall
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;//timeStep;
        log             true;
        writeArea       true; //write for OF 3.0 to be consistent
        valueOutput     true;
        source          patch;
        sourceName      wall;
        operation       sum;

        fields
        (
            phi
        );
        surfaceFormat null;
    }
);
// ************************************************************************* //
